/*
   Localizable.strings - Arabic
   modizer

   Organized by screens and feature families
*/

// ================================
// MARK: - COMMON / GENERAL
// ================================

/* Common Actions */
"Yes" = "نعم";
"No" = "لا";
"Ok" = "حسناً";
"Cancel" = "إلغاء";
"Close" = "إغلاق";
"Save" = "حفظ";
"Delete" = "حذف";
"Rename" = "إعادة تسمية";
"Extract" = "استخراج";
"Cut" = "قص";
"Paste" = "لصق";
"Create" = "إنشاء";
"Reset" = "إعادة تعيين";

/* Common States */
"Loading" = "جاري التحميل";
"Extracting" = "جاري الاستخراج";
"Seeking" = "جاري البحث";
"Seeking %d%%" = "جاري البحث %d%%";
"Refreshing" = "جاري التحديث";
"Browsing" = "جاري الاستعراض";
"Cancelling..." = "جاري الإلغاء...";

/* Common Messages */
"Error" = "خطأ";
"OK" = "موافق";
"Warning" = "تحذير";
"Do you want to reset to default value:\n" = "هل تريد إعادة التعيين للقيمة الافتراضية:\n";


// ================================
// MARK: - BROWSER
// ================================

/* Browser Main Keys */
"Browser_LocalBrowsing_MainKey" = "الاستعراض المحلي";
"Browser_LocalBrowsing_SubKey" = "استعراض، تشغيل وحذف الملفات المحلية.";

"Browser_MODLAND_MainKey" = "مجموعة MODLAND";
"Browser_MODLAND_SubKey" = "%d ملف قابل للتنزيل.";

"Browser_HVSC_MainKey" = "مجموعة HVSC";
"Browser_HVSC_SubKey" = "%d ملف قابل للتنزيل.";

"Browser_Playlists_MainKey" = "قوائم التشغيل";
"Browser_Playlists_SubKey" = "تنظيم، إنشاء، حذف والاستماع.";

"Browser_Favorites_MainKey" = "المفضلة";
"Browser_Favorites_SubKey" = "الاستماع للأغاني المصنفة.";

"Browser_Most_played_MainKey" = "الأكثر تشغيلاً";
"Browser_Most_played_SubKey" = "الاستماع للأغاني الأكثر تشغيلاً.";

"Browser_Web_MainKey" = "الويب";
"Browser_Web_SubKey" = "تصفح الإنترنت وتنزيل الموسيقى.";

"Browser_WorldCharts_MainKey" = "قوائم عالمية";
"Browser_WorldCharts_SubKey" = "قوائم أعلى الأغاني وروابط التنزيل.";

"Browser_WebVGM_MainKey" = "VGMRips";
"Browser_WebVGM_SubKey" = "موسيقى ألعاب الفيديو";

"Browser_UserGuide_MainKey" = "دليل المستخدم";
"Browser_UserGuide_SubKey" = "دليل، أسئلة شائعة، نصائح.";

/* Browser Display Modes */
"GetAllEntries_MainKey" = "الحصول على جميع الإدخالات المفقودة";
"GetAllEntries_SubKey" = "محدودة بـ 256 إدخال أول.";

"DisplayAll_MainKey" = "عرض الكل مرتبة حسب الاسم";
"DisplayAll_SubKey" = "المجلد الحالي:";

"DisplayDir_MainKey" = "قائمة/مجلد";
"DisplayDir_SubKey" = "الكل مرتبة حسب المسار:";

"DisplayAllPath_MainKey" = "عرض الكل مرتبة حسب المسار";
"DisplayAllPath_SubKey" = "الكل مرتبة حسب الاسم:";

/* Browser View Modes */
"Formats/Artists/Files" = "التنسيقات/الفنانون/الملفات";
"Artists/Formats/Files" = "الفنانون/التنسيقات/الملفات";
"Artists/Files" = "الفنانون/الملفات";
"Formats: %d entries." = "التنسيقات: %d إدخال.";
"Artists: %d entries." = "الفنانون: %d إدخال.";

/* Browser Stats */
"Played %d times." = "تم التشغيل %d مرة.";
"Played once." = "تم التشغيل مرة واحدة.";
"Never played." = "لم يتم التشغيل أبداً.";
"%d files." = "%d ملف.";
"1 file." = "ملف واحد.";
"Size: %dKB" = "الحجم: %dكيلوبايت";

/* Browser Messages */
"Browser not enough mem." = "إدخالات كثيرة، تعذر تخصيص الذاكرة.";
"Browser not enough mem. Limited." = "إدخالات كثيرة، تعذر تخصيص الذاكرة. القائمة غير مكتملة.";

/* File Operations */
"New folder" = "مجلد جديد";
"Enter folder name" = "أدخل اسم المجلد";
"Nothing to paste" = "لا يوجد شيء للصق";
"No file to extract or not supported archive format.\n" = "لا يوجد ملف لاستخراجه أو تنسيق أرشيف غير مدعوم.\n";
"Cannot use iCloud as folder name" = "لا يمكن استخدام iCloud كاسم مجلد";

"Issue %d while trying to delete entry.\n%@" = "مشكلة %d أثناء محاولة حذف الإدخال.\n%@";
"Issue %d while trying to renamefile.\n%@" = "مشكلة %d أثناء محاولة إعادة تسمية الملف.\n%@";
"Issue %d while moving: %@.\n%@" = "مشكلة %d أثناء النقل: %@.\n%@";
"Issue %d while creating folder\n%@" = "مشكلة %d أثناء إنشاء المجلد\n%@";

"File is not available locally.\nTrigerring download from iCloud, please check in 'Files' application." = "الملف غير متوفر محلياً.\nجاري تشغيل التنزيل من iCloud، يرجى التحقق في تطبيق 'الملفات'.";

"unavailable" = "غير متوفر";

// ================================
// MARK: - SEARCH
// ================================

/* Search States */
"Playlist (%d)" = "قائمة التشغيل (%d)";
"Playlist/Search off" = "قائمة التشغيل/البحث متوقف";

"Local (%d, limited to %d)" = "محلي (%d، محدود إلى %d)";
"Local (%d)" = "محلي (%d)";
"Local/Search off" = "محلي/البحث متوقف";

"Modland (%d, limited to %d)" = "Modland (%d، محدود إلى %d)";
"Modland (%d)" = "Modland (%d)";
"Modland/Search off" = "Modland/البحث متوقف";

"HVSC (%d, limited to %d)" = "HVSC (%d، محدود إلى %d)";
"HVSC (%d)" = "HVSC (%d)";
"HVSC/Search off" = "HVSC/البحث متوقف";

"ASMA (%d, limited to %d)"="ASMA (%d، محدود إلى %d)";
"ASMA (%d)"="ASMA (%d)";
"ASMA/Search off"="ASMA/البحث متوقف";

/* Search Messages */
"Searching Playlists..." = "جاري البحث في قوائم التشغيل...";
"Searching Local files..." = "جاري البحث في الملفات المحلية...";
"Searching MODLAND..." = "جاري البحث في MODLAND...";
"Searching HVSC..." = "جاري البحث في HVSC...";

"Please enter at least 2 characters for your search." = "يرجى إدخال حرفين على الأقل للبحث.";
"Please activate at least 1 section for your search." = "يرجى تفعيل قسم واحد على الأقل للبحث.";


// ================================
// MARK: - PLAYER / NOW PLAYING
// ================================

/* Player States */
"Now playing" = "قيد التشغيل الآن";
"Now playing(%d)" = "قيد التشغيل الآن(%d)";
"Most played" = "الأكثر تشغيلاً";
"Favorites" = "المفضلة";
"Resuming last\nplayed file" = "استئناف آخر\nملف تم تشغيله";

/* Player Controls */
"Previous" = "السابق";
"Previous file" = "الملف السابق";
"Next file" = "الملف التالي";
"Next" = "التالي";
"Shuffle" = "خلط";
"Voices control" = "التحكم بالأصوات";
"All voices" = "جميع الأصوات";
"Clear 'Now Playing' queue" = "مسح قائمة 'قيد التشغيل الآن'";

/* Song Selection */
"Choose a subsong" = "اختر أغنية فرعية";
"Choose a song" = "اختر أغنية";

/* Player Messages */
"Nothing currently playing. Please select a file." = "لا يوجد شيء قيد التشغيل. يرجى اختيار ملف.";
"File cannot be played. Skipping to next playable file." = "لا يمكن تشغيل الملف. التخطي للملف التالي القابل للتشغيل.";
"Too much entries! Playlist will be limited to %d first entries." = "إدخالات كثيرة! ستقتصر قائمة التشغيل على أول %d إدخال.";
"Playlist is full. Delete some entries to add more." = "قائمة التشغيل ممتلئة. احذف بعض الإدخالات لإضافة المزيد.";

/* Metadata */
"unknown_title" = "عنوان غير معروف";
"unknown_album" = "ألبوم غير معروف";
"now_playing_format" = "يتم التشغيل: %@ من %@";


// ================================
// MARK: - PLAYLISTS
// ================================

/* Playlist Actions */
"New playlist" = "قائمة تشغيل جديدة";
"Create new playlist" = "إنشاء قائمة تشغيل جديدة";
"Save current one" = "حفظ القائمة الحالية";
"Rename playlist" = "إعادة تسمية قائمة التشغيل";
"Add to a playlist" = "إضافة لقائمة تشغيل";
"Choose a playlist" = "اختر قائمة تشغيل";

/* Playlist Descriptions */
"Create a new empty playlist." = "إنشاء قائمة تشغيل جديدة فارغة.";
"Create a playlist from currently played files." = "إنشاء قائمة تشغيل من الملفات المشغلة حالياً.";
"Browse files" = "استعراض الملفات";
"Add or remove entries from browser." = "إضافة أو إزالة إدخالات من المتصفح.";
"Choose a new name." = "اختر اسماً جديداً.";

/* Playlist Confirmations */
"Are you sure you want to delete this playlist ?" = "هل أنت متأكد من حذف قائمة التشغيل هذه؟";
"Are you sure you want to delete this entry ?" = "هل أنت متأكد من حذف هذا الإدخال؟";


// ================================
// MARK: - DOWNLOADS
// ================================

"Downloads" = "التنزيلات";
"Download queue: 1 file" = "قائمة التنزيل: ملف واحد";
"Download queue: %d files" = "قائمة التنزيل: %d ملف";
"No download in progress" = "لا يوجد تنزيل قيد التنفيذ";
"Downloaded %@" = "تم تنزيل %@";
"Downloading %@" = "جاري تنزيل %@";
"Cannot download from this URL." = "لا يمكن التنزيل من هذا الرابط.";
"Could not add files. Please check manually with file browser (Local Browsing/Downloads)." = "تعذر إضافة الملفات. يرجى التحقق يدوياً باستخدام متصفح الملفات (الاستعراض المحلي/التنزيلات).";
"File already available locally. Do you want to download it again?" = "الملف متوفر بالفعل محلياً. هل تريد تنزيله مرة أخرى؟";
"URL have to start with ftp:// or http://" = "يجب أن يبدأ الرابط بـ ftp:// أو http://";
"Cannot connect to FTP." = "لا يمكن الاتصال بـ FTP.";


// ================================
// MARK: - DATABASE
// ================================

"Database created." = "تم إنشاء قاعدة البيانات.";
"Database will now be recreated. Please validate & wait." = "سيتم إعادة إنشاء قاعدة البيانات الآن. يرجى التأكيد والانتظار.";
"Wrong database version: %d.%d. Will update to %d.%d. Please validate & wait." = "إصدار قاعدة بيانات خاطئ: %d.%d. سيتم التحديث إلى %d.%d. يرجى التأكيد والانتظار.";
"No database found. Will create a new one. Please validate & wait..." = "لم يتم العثور على قاعدة بيانات. سيتم إنشاء قاعدة جديدة. يرجى التأكيد والانتظار...";


// ================================
// MARK: - COVERS / IMAGES
// ================================

"Image detected" = "تم اكتشاف صورة";
"Choose_SaveCover" = "حفظ الصورة كغلاف لـ %@؟";
"CoverFolder" = "كغلاف المجلد";
"CoverFile" = "كغلاف الملف";
"Confirm_RemCurCovers" = "إزالة الأغلفة الحالية لـ %@ (المجلد والملف)؟";


// ================================
// MARK: - SETTINGS - GENERAL
// ================================

/* Settings Sections */
"Settings_General" = "عام";
"Settings_Player" = "المشغّل";
"Settings_Display" = "العرض";
"Settings_Download" = "التنزيل";
"Settings_FTP" = "FTP";
"Settings_PlaybackLib" = "مكتبات التشغيل";
"Settings_Settings" = "الإعدادات";

/* Settings Presets */
"Settings_SettingsDefault" = "افتراضي";
"Settings_SettingsHigh" = "عالي";
"Settings_SettingsMed" = "متوسط";
"Settings_SettingsLow" = "منخفض";

"Confirm_SettingsDef" = "هل أنت متأكد من إعادة تعيين الإعدادات بالقيم 'الافتراضية'؟";
"Confirm_SettingsHigh" = "هل أنت متأكد من إعادة تعيين الإعدادات بالقيم 'العالية'؟";
"Confirm_SettingsMed" = "هل أنت متأكد من إعادة تعيين الإعدادات بالقيم 'المتوسطة'؟";
"Confirm_SettingsLow" = "هل أنت متأكد من إعادة تعيين الإعدادات بالقيم 'المنخفضة'؟";

/* Global Player Settings */
"Search: simplified regexp ('.'->'\\.', '*'->'.*')" = "البحث: تعبير عادي مبسط ('.'->'\\.', '*'->'.*')";
"Resume position on launch" = "استئناف الموضع عند التشغيل";
"Notification" = "الإشعار";
"Notification duration" = "مدة الإشعار";
"Disable screen auto lock" = "تعطيل قفل الشاشة التلقائي";
"No screen auto lock" = "لا قفل تلقائي للشاشة";
"Enable playback ratio" = "تفعيل نسبة التشغيل";
"Playback ratio" = "نسبة التشغيل";
"Default length" = "المدة الافتراضية";
"Default length %d:%.2d" = "المدة الافتراضية %d:%.2d";
"Fade-out time" = "وقت التلاشي";
"Silence Detection" = "كشف الصمت";
"Stop song if silent for more than selected number of seconds. 0: off" = "إيقاف الأغنية إذا كانت صامتة لأكثر من عدد الثواني المحدد. 0: إيقاف";
"Will skip song if nothing is played for specified duration (0=off)" = "سيتم تخطي الأغنية إذا لم يتم تشغيل شيء للمدة المحددة (0=إيقاف)";
"Force mono" = "فرض أحادي";
"Panning" = "التوزيع الصوتي";
"Panning value" = "قيمة التوزيع الصوتي";
"Audio latency" = "تأخير الصوت";
"Audio latency in ms" = "تأخير الصوت بالميلي ثانية";
"Multi default action" = "الإجراء الافتراضي متعدد";
"Browse" = "استعراض";
"Archive/multi play mode" = "وضع الأرشيف/التشغيل المتعدد";
"Entry"="إدخال";

/* Archive Settings */
"Archive multi default action" = "الإجراء الافتراضي للأرشيف المتعدد";
"Archive multi play mode" = "وضع التشغيل المتعدد للأرشيف";

/* Playlist Settings */
"Play/Enqueue action" = "إجراء التشغيل/الإضافة للقائمة";
"Enqueue mode" = "وضع الإضافة للقائمة";
"Default Action" = "الإجراء الافتراضي";
"Play" = "تشغيل";
"Enqueue" = "إضافة للقائمة";
"Enq.&Play" = "إضافة وتشغيل";
"First" = "الأول";
"Current" = "الحالي";
"Last" = "الأخير";
"Enqueue position" = "موضع الإضافة للقائمة";
"Post download action" = "الإجراء بعد التنزيل";
"Nothing" = "لا شيء";

/* Display Settings */
"Background mode" = "وضع الخلفية";
"Partial" = "جزئي";
"Full" = "كامل";
"Off=no background process, Partial=keep playing music, Full=keep app on in background" = "إيقاف=لا عملية خلفية، جزئي=استمرار تشغيل الموسيقى، كامل=إبقاء التطبيق مفعلاً في الخلفية";
"Long name truncate" = "اقتطاع الاسم الطويل";
"Head" = "البداية";
"Mid." = "الوسط";
"Tail" = "النهاية";
"Filename as title" = "اسم الملف كعنوان";

/* Local Files Settings */
"Auto. restore Samples folder" = "استعادة مجلد العينات تلقائياً";
"Send statistics" = "إرسال الإحصائيات";


// ================================
// MARK: - SETTINGS - DATABASE
// ================================

"Settings_DB" = "قاعدة البيانات";
"Settings_CleanDB" = "تنظيف قاعدة البيانات";
"Settings_ResetPlCnt" = "إعادة تعيين عدادات التشغيل";
"Settings_ResetRatings" = "إعادة تعيين التصنيفات";
"Settings_ResetDB" = "إعادة تعيين قاعدة البيانات بالكامل";

"Confirm_DBClean" = "بدء تنظيف قاعدة البيانات (قد يستغرق بعض الوقت)؟";
"Confirm_Reset_PlCnt" = "هل أنت متأكد من إعادة تعيين جميع عدادات التشغيل؟";
"Confirm_Reset_Ratings" = "هل أنت متأكد من إعادة تعيين جميع التصنيفات؟";
"Confirm_ResetDB" = "هل أنت متأكد من إعادة تعيين قاعدة البيانات بالكامل؟ سيتم حذف قوائم التشغيل والتصنيفات والعدادات.";


// ================================
// MARK: - SETTINGS - LOCAL FILES
// ================================

"Settings_LocalFiles" = "الملفات المحلية";
"Settings_RecreateSamples" = "إعادة إنشاء مجلد 'العينات'";
"Settings_FormatDownloads" = "تنسيق مجلد 'التنزيلات'";
"Settings_RemCovers" = "إزالة الأغلفة";
"Settings_UpdateFilesBackupFlag" = "فحص نظام الملفات";

"Confirm_RecreateSamples" = "هل تريد إعادة إنشاء مجلد 'العينات'.";
"Confirm_FormatDownloads" = "هل تريد إزالة جميع الملفات من الاستعراض المحلي/مجلد الويب.";
"Confirm_CheckFiles" = "هل تريد إجراء فحص نظام الملفات المحلي؟";


// ================================
// MARK: - SETTINGS - PLUGINS
// ================================

/* AdPlug */
"OPL type" = "نوع OPL";
"Stereo surround" = "محيط استريو";

/* GBSPlay */
"HP filter type" = "نوع مرشح HP";
"Highpass filter type" = "نوع المرشح العالي";

/* Game Music Emu (GME) */
"Stereo separation" = "فصل الاستريو";
"Ignore silence" = "تجاهل الصمت";
"Silence detection" = "كشف الصمت";
"Equalizer" = "معادل الصوت";
"Bass" = "الباس";
"Treble" = "الترابل";

/* GSF */
"Sound quality" = "جودة الصوت";
"Interpolation" = "الاستيفاء";
"Low-pass filter" = "مرشح منخفض";
"Echo" = "صدى";

/* Highly Complete (HC) */
"Resample quality" = "جودة إعادة العينة";
"Main enabled" = "الرئيسي مفعّل";
"Reverb enabled" = "الصدى مفعّل";

/* NSFPlay */
"NSFPLAY default length" = "المدة الافتراضية لـ NSFPLAY";
"LPF strength" = "قوة LPF";
"Min=off, default: 112" = "الحد الأدنى=إيقاف، الافتراضي: 112";
"HPF strength" = "قوة HPF";
"Region" = "المنطقة";
"VRC7 Patches" = "رقع VRC7";
"Force IRQ" = "فرض IRQ";
"Quality" = "الجودة";

/* OpenMPT */
"Master volume" = "مستوى الصوت الرئيسي";
"Sampling" = "أخذ العينات";
"Resampling" = "إعادة أخذ العينات";

/* SID */
"Engine" = "المحرك";
"Filter" = "المرشح";
"Force loop" = "فرض التكرار";
"Clock" = "الساعة";
"Model" = "الطراز";
"Force 2nd SID" = "فرض SID الثاني";
"Address 2nd" = "عنوان الثاني";
"0xD420-0xD7FF or 0xDE00-0xDFFF" = "0xD420-0xD7FF أو 0xDE00-0xDFFF";
"Force 3rd SID" = "فرض SID الثالث";
"Address 3rd" = "عنوان الثالث";

/* Timidity */
"Max loop" = "التكرار الأقصى";
"MIDI polyphony" = "تعدد أصوات MIDI";
"Amplification" = "التضخيم";
"Chorus" = "الكورس";
"Reverb" = "الصدى";
"Resample" = "إعادة العينة";
"LP filter" = "مرشح LP";

/* UADE */
"Headphones" = "سماعات الرأس";
"LED filter" = "مرشح LED";
"Normalization" = "التطبيع";
"Post FX" = "مؤثرات لاحقة";
"Panning" = "التوزيع الصوتي";
"Panning value" = "قيمة التوزيع الصوتي";
"Gain" = "الكسب";
"Gain value" = "قيمة الكسب";
"Force NTSC" = "فرض NTSC";

/* VGMPlay */
"Prefer JTAG" = "تفضيل JTAG";
"YM2612 emulator" = "محاكي YM2612";
"Nuked OPN2 option" = "خيار Nuked OPN2";
"YMF262 emulator" = "محاكي YMF262";
"YM3812 emulator" = "محاكي YM3812";
"QSound emulator" = "محاكي QSound";
"RF5C68 emulator" = "محاكي RF5C68";

/* VGMStream */
"Max loop" = "التكرار الأقصى";

/* XMP */
"Amiga 500 Filter" = "مرشح Amiga 500";


// ================================
// MARK: - SETTINGS - VISUALIZATIONS
// ================================

/* General FX */
"FX Alpha" = "شفافية المؤثرات";
"FX Fullscreen" = "المؤثرات بملء الشاشة";
"FX FPS" = "إطارات المؤثرات";
"FX show info" = "إظهار معلومات المؤثرات";
"Tech Info" = "معلومات تقنية";
"Show FPS and other infos (CPU, Resolution, ProjectM audio data)" = "إظهار FPS ومعلومات أخرى (المعالج، الدقة، بيانات صوت ProjectM)";
"FX Level of details" = "مستوى تفاصيل المؤثرات";
"Low" = "منخفض";
"Med" = "متوسط";
"High" = "عالي";
"Slow FX limit" = "حد المؤثرات البطيئة";
"Deactivate FX if too slow." = "تعطيل المؤثرات إذا كانت بطيئة جداً.";
"Weak" = "ضعيف";
"Strong" = "قوي";
"Display song info" = "عرض معلومات الأغنية";
"When in fulllscreen, display song info when it changes. TL is Top Left, DR is Bottom Right, C is Center." = "عند ملء الشاشة، عرض معلومات الأغنية عند التغيير. TL أعلى اليسار، DR أسفل اليمين، C الوسط.";

/* ProjectM */
"ProjectM settings" = "إعدادات ProjectM";
"ProjectM on/off" = "تشغيل/إيقاف ProjectM";
"Show preset label" = "إظهار تسمية الإعداد المسبق";
"Auto switch presets mode" = "وضع التبديل التلقائي للإعدادات المسبقة";
"Lock preset" = "قفل الإعداد المسبق";
"Time between preset" = "الوقت بين الإعدادات المسبقة";
"Blend presets" = "مزج الإعدادات المسبقة";
"Blend time" = "وقت المزج";
"Bundled presets" = "الإعدادات المسبقة المدمجة";
"Custom presets" = "الإعدادات المسبقة المخصصة";
"Aspect ratio" = "نسبة العرض";
"Mesh size X" = "حجم الشبكة X";
"Mesh size Y" = "حجم الشبكة Y";
"Hard cut enabled" = "القطع الحاد مفعّل";
"Hard cut min time" = "الحد الأدنى لوقت القطع الحاد";
"Hard cut sensitivity" = "حساسية القطع الحاد";
"Beat sensitivity" = "حساسية النبض";
"Permissive mode" = "الوضع المتساهل";

/* Oscilloscope */
"Oscillo settings" = "إعدادات الراسم";
"FX mode" = "وضع المؤثرات";
"Show label" = "إظهار التسمية";
"Label font size" = "حجم خط التسمية";
"Show grid" = "إظهار الشبكة";
"Grid color" = "لون الشبكة";
"Line width" = "عرض الخط";
"Mono color" = "لون أحادي";
"Multi color set" = "مجموعة ألوان متعددة";
"Reset all colors" = "إعادة تعيين جميع الألوان";
"Thin" = "رفيع";
"Medium" = "متوسط";
"Thick" = "سميك";
"Beefy" = "ضخم";

/* Piano Roll / MIDI */
"Piano roll" = "لفافة البيانو";
"Activate Piano roll FX, standard or 'Synthesia' like" = "تفعيل مؤثرات لفافة البيانو، قياسية أو نمط 'Synthesia'";
"Activate spark FX, colored or white" = "تفعيل مؤثرات الشرارة، ملونة أو بيضاء";
"Display voices labels" = "عرض تسميات الأصوات";
"Display octaves labels" = "عرض تسميات الأوكتافات";
"MIDI pattern" = "نمط MIDI";
"MIDI cut line" = "خط قطع MIDI";
"MIDI bar style" = "نمط شريط MIDI";
"MIDI bar vibrato" = "اهتزاز شريط MIDI";
"Piano 3D" = "بيانو ثلاثي الأبعاد";
"Piano cut line" = "خط قطع البيانو";
"Piano color mode" = "وضع لون البيانو";

/* Spectrum */
"3D spectrum" = "طيف ثلاثي الأبعاد";
"3D spectrum bloom" = "توهج الطيف ثلاثي الأبعاد";
"Spectrum" = "الطيف";
"3D landscape" = "منظر طبيعي ثلاثي الأبعاد";
"3D landscape bloom" = "توهج المنظر الطبيعي ثلاثي الأبعاد";

/* MOD Pattern */
"MOD pattern" = "نمط MOD";
"MOD pattern BG alpha" = "شفافية خلفية نمط MOD";
"MOD pattern vol bar" = "شريط مستوى صوت نمط MOD";
"MOD pattern current line mode" = "وضع السطر الحالي لنمط MOD";
"MOD pattern font" = "خط نمط MOD";
"MOD pattern font size" = "حجم خط نمط MOD";
"MOD pattern theme" = "سمة نمط MOD";


// ================================
// MARK: - WEB BROWSER
// ================================

"Browser_Welcome_Message" = "<b>مرحبًا بك في متصفح Modizer!</b><br><br>استخدم شريط العناوين أعلاه للتنقل أو استكشف الإشارات المرجعية.<br><br>لاستخدام صورة كغلاف، انسخها إلى الحافظة بالضغط المطول (iOS) أو النقر بزر الماوس الأيمن (macOS).";
"Bookmarks" = "الإشارات المرجعية";


// ================================
// MARK: - ABOUT
// ================================

"About_Text" = "v4.1 © Yohann Magnien / YoyoFR\n\nالتواصل: mailto:modizerhelp@gmail.com\nالموقع: https://modizer.app\n\nشعار Modizer من تصميم Steve Miele.\n\nعدد تنسيقات/امتدادات الملفات المدعومة: 1090.\n!PM!,04SW,208,2DX9,2PSF,2SF,2SFLIB,3DO,4,40A,40B,41A,50A,60A,61A,669,800,9TAV,A2M,AAC,AAM,AAX,ABK,AC1,AC1D,ACB,ACM,ACX,ADL,ADLIB,ADM,ADP,ADPCM,ADPCMX,ADS,ADSC,ADW,ADX,AFC,AFS2,AGD,AGI,AGSC,AHV,AHX,AI,AIF,AIF-LOOP,AIFC,AIFCL,AIFF,AIFFL,AIX,AKB,AL,AL2,ALP,AMC,AMD,AMF,AMS,AMTS,AO,AON,AON4,AON8,AP,APC,APE,AS0,AS3M,AS4,ASC,ASD,ASF,ASR,ASS,AST,AT3,AT9,ATSL,ATSL3,ATSL4,ATX,AUD,AUS,AVAL,AVP,AWB,AWC,AY,B1S,BAF,BAKA,BAM,BANK,BAO,BAR,BCSTM,BCWAV,BD,BD3,BDS,BDSP,BFC,BFSTM,BFWAV,BFWAVNSMBU,BG00,BGM,BGW,BH2PCM,BIK,BIK2,BIKA,BIN,BK2,BLK,BMDX,BMF,BMS,BNK,BNM,BNS,BNSF,BO2,BP,BP3,BRSTM,BRSTMSPM,BSF,BSI,BSND,BSS,BTSND,BVG,BWAV,BYTES,C64,C67,CAF,CAPDSP,CBD2,CC3,CCC,CD,CFF,CFN,CHAN,CHI,CHK,CHP,CIN,CKB,CKD,CKS,CM,CM3,CMC,CMF,CMR,CMS,CNK,COP,CORE,CP,CPK,CPLX,CPS,CRB,CSB,CSMP,CTRL,CUS,CUST,CUSTOM,CVS,CWAV,CXS,D00,DA,DAT,DATA,DAX,DB,DBM,DCS,DCT,DDSP,DE2,DEC,DFM,DH,DI,DIGI,DIVA,DL,DLM1,DLM2,DLN,DLT,DL_DELI,DM0,DM1,DM2,DMC,DMF,DMM,DMO,DMSG,DMU,DMU2,DNS,DODA,DP,DR0,DRO,DS2,DSB,DSC,DSF,DSFLIB,DSM,DSP,DSPW,DSQ,DSR,DSS,DST,DTK,DTM,DUM,DVI,DW,DWOLD,DXH,DZ,E4X,EA,EAM,EAS,EMFF,EMOD,EMS,EMSV6,ENM,ENO,ENS,ESV,ET1,EU,EUP,EX,EXA,EZW,FAG,FAR,FC,FC-BSI,FC-M,FC13,FC14,FC3,FC4,FCM,FDA,FDI,FFW,FILP,FLAC,FLX,FMB,FNK,FP,FRED,FSB,FSV,FT,FTC,FUZ,FUZZ,FW,FWAV,FWSE,G1L,GAM,GAMPLUS,GBR,GBS,GBTS,GCA,GCM,GCUB,GCW,GDM,GENH,GIN,GLUE,GM,GMC,GMS,GOT,GRAY,GSB,GSF,GSFLIB,GTD,GTR,GV,GWM,GYM,H4M,HA2,HAB,HBT,HCA,HD,HDR,HES,HGC1,HIP,HIP7,HIPC,HIS,HMC,HN,HPS,HRM,HRP,HRT,HRT!,HSC,HSF,HSP,HSQ,HST,HVL,HWAS,HX2,HX3,HXC,HXD,HXG,HXX,IAB,IADP,ICE,IDMSF,IDSP,IDVI,IDWAV,IDXMA,IFS,IKM,ILD,IMA,IMC,IMF,IMS,IMX,INSTR,INT,IS,IS14,IS20,ISB,ISD,ISWS,IT,IT1,ITL,IVAG,IVAUD,IVB,J2B,JAM,JBM,JC,JCB,JCBO,JD,JMF,JO,JOE,JP,JPN,JPND,JPO,JPOLD,JSTM,JT,KAT,KCES,KCEY,KEF,KEF7,KH,KM9,KNS,KOVS,KRAW,KRIS,KRS,KSM,KSS,KTAC,KTSL2ASBIN,KTSS,KVS,L,LAA,LAAC,LAIF,LAIFC,LAIFF,LASF,LAX,LBIN,LDS,LEG,LEP,LIN,LIQ,LM0,LM1,LM2,LM3,LM4,LM5,LM6,LM7,LME,LMP3,LMP4,LOGG,LOPUS,LP,LPCM,LPK,LPS,LRMB,LSE,LSF,LSTM,LWAV,LZS,M,M15,M2,M3U,M4A,M4V,MA,MAB,MAD,MAP,MATX,MAX,MBM,MC,MC3,MCA,MCADPCM,MCG,MCMD,MCMD_ORG,MCO,MCR,MD,MDAT,MDI,MDL,MDS,MDSP,MDST,MDX,MDY,MED,MEXXMP,MFP,MG,MGS,MI4,MIB,MIC,MID,MIDI,MIHB,MINI2SF,MINIDSF,MINIGSF,MININCSF,MINIPSF,MINIPSF2,MINIQSF,MINISNSF,MINISSF,MINIUSF,MJB,MK2,MKF,MKII,MKIIO,MKJ,ML,MM4,MM8,MMCMP,MMD0,MMD1,MMD2,MMD3,MMD4,MMDC,MMS,MNSTR,MO3,MOD,MOD15,MOD15_MST,MOD15_ST-IV,MOD15_UST,MOD_ADSC4,MOD_COMP,MOD_DOC,MOD_FLT4,MOD_NTK,MOD_NTK1,MOD_NTK2,MOD_NTKAMP,MOGG,MOK,MON,MON_OLD,MP3,MP4,MPD,MPDSP,MPF,MPG,MPK,MPRO,MPT,MPTM,MS,MSA,MSADPCM,MSB,MSC,MSD,MSF,MSO,MSP,MSS,MSV,MSVP,MT2,MTA2,MTAF,MTK,MTM,MTP2,MTR,MUG,MUG2,MUL,MUPS,MUS,MUSC,MUSX,MW,MWV,MXST,MYSPD,MZ,N64,NAAC,NCSF,NCSFLIB,NDP,NDS,NGCA,NLSD,NOISEPACKER2,NOISEPACKER3,NOP,NP,NP1,NP2,NP3,NPS,NPSF,NR,NRU,NSF,NSFE,NSOPUS,NST,NTP,NTPK,NUB,NUB2,NUS3AUDIO,NUS3BANK,NWA,NWAV,NXA,OCTAMED,OGG,OGL,OKT,OMU,ONE,OPI,OPUS,OPUSX,OPX,ORG,OSP,OTM,OVB,OVI,OXM,OZI,P,P00,P10,P21,P2BT,P30,P3D,P40A,P40B,P41A,P4X,P50A,P5A,P5X,P60,P60A,P61,P61A,P6X,P86,PAP,PAST,PCD,PCM,PDT,PDX,PFLT,PHA,PIN,PIS,PK,PLM,PM,PM0,PM01,PM1,PM10C,PM18A,PM2,PM20,PM4,PM40,PMB,PMZ,PNB,POLK,PONA,POS,POWT,PP10,PP20,PP21,PP30,PPC,PPK,PPM,PPS,PPZ,PR1,PR2,PRG,PROM,PRU,PRU1,PRU2,PRUN,PRUN1,PRUN2,PS,PS2STM,PSA,PSC,PSF,PSF2,PSF2LIB,PSFLIB,PSG,PSH,PSID,PSM,PSND,PSW,PT,PT1,PT2,PT3,PT36,PTCOP,PTM,PTTUNE,PUMA,PVI,PVP,PWR,PXA,PYG,PYGM,PYGMY,PZI,QC,QPA,QSF,QSFLIB,QTS,R,RAC,RAD,RAK,RAS,RAW,RH,RHO,RIFF,RIX,RJP,RK,RKB,RKV,RMT,RND,ROF,ROL,RPGMVO,RRDS,RSD,RSF,RSID,RSM,RSP,RSTM,RTM,RWAR,RWAV,RWS,RWSD,RWX,RXW,S-C,S14,S3M,S7G,S98,S98xxxxxxxxx,SA,SA-P,SA2,SAB,SAD,SAF,SAP,SAS,SAT,SA_OLD,SB,SB0,SB1,SB2,SB3,SB4,SB5,SB6,SB7,SBIN,SBK,SBR,SBV,SC,SC68,SCD,SCH,SCI,SCL,SCN,SCR,SCT,SCUMM,SD9,SDB,SDF,SDR,SDT,SEB,SED,SEG,SF0,SF2,SFL,SFM,SFS,SFX,SFX13,SFX2,SG,SGB,SGC,SGD,SGX,SID,SID1,SID2,SJS,SKT,SKYT,SL3,SLI,SM,SM0,SM1,SM2,SM3,SM4,SM5,SM6,SM7,SMC,SMK,SMN,SMP,SMPL,SMPRO,SMUS,SMV,SND,SNDH,SNDMON,SNDS,SNG,SNGW,SNK,SNR,SNS,SNSF,SNSFLIB,SNT,SNT!,SNU,SNX,SOC,SOD,SOG,SON,SONIC,SOP,SPC,SPD,SPK,SPL,SPM,SPS,SPSD,SPW,SQD,SQT,SQX,SS,SS2,SSF,SSFLIB,SSM,SSS,ST,ST1,ST2,ST26,ST3,ST30,STAR,STC,STER,STK,STM,STMA,STP,STPK,STR,STREAM,STRM,STS,STX,SUN,SVAG,SVG,SVS,SWAG,SWAV,SWD,SWITCH_AUDIO,SX,SXD,SXD1,SXD2,SXD3,SYN,SYNMOD,SZX,TD0,TEC,TF,TF0,TFC,TFD,TFE,TFHD1.5,TFHD7V,TFHDPRO,TFMX,TFMX1.5,TFMX7V,TFMXPRO,TGQ,TGV,THM,THN,THP,THX,TINY,TK5,TLZ,TLZP,TM2,TM8,TMC,TME,TMX,TP,TP1,TP2,TP3,TPU,TRA,TRC,TRD,TRO,TRONIC,TRS,TS,TUN,TW,TWO,TXT,TXTH,TXTP,TYDSP,UDS,UE4OPUS,ULT,ULW,UM3,UMX,UN2,UNIC,UNIC2,USF,USFLIB,UTK,UV,V0,V1,V2M,V2MZ,VA3,VAG,VAI,VAS,VAWX,VB,VBK,VDM,VDS,VGM,VGS,VGV,VGZ,VID,VIG,VIS,VMS,VOI,VP6,VPK,VS,VSF,VSS,VSV,VTX,VXN,WAA,WAC,WAD,WAF,WAM,WAS,WAV,WAVC,WAVE,WAVEBATCH,WAVM,WAY,WB,WB2,WBD,WD,WEM,WII,WLF,WMA,WMUS,WN,WOW,WP2,WPD,WSD,WSI,WSR,WUA,WV2,WV6,WVE,WVS,WVX,X,XA,XA2,XA30,XAD,XAG,XAN,XANN,XAU,XAV,XEN,XM,XMA,XMA2,XMD,XMU,XNA,XNB,XOPUS,XPK,XPS,XSE,XSEW,XSF,XSM,XSS,XVAG,XVAS,XWAV,XWB,XWC,XWM,XWMA,XWS,XWV,YDSP,YM,YMF,ZEN,ZIC,ZSD,ZSM,ZSS,ZWDSP,ZWV,ZXZIP\nمكتبات المشغل المدمجة:\n- Adplug\n- Another Slight Atari Player(ASAP)\n- AtariSound\n- Eupmini\n- ffmpeg/mpg123/vorbis\n- Game Music Emu\n- FMPmini\n- Highly Complete\n- AHX/Hively tracker\n- LazyUSF\n- Libvgm\n- Mdxplay\n- NSFPlay\n- OpenMPT\n- PlayGSF\n- Pmdmini\n- PxTone / Organya\n- PT3Player\n- SC68\n- Sibplayfp\n- Snes9x/snsf\n- ST-Sound\n- Timidity(using Merlin_gold SF2 soundfont)\n- UADE\n- XSF (2SF, NCSF)\n- XMP\n-V2M tinyplayer\n- VGMStream\n- VIO2SF\n- WebSID\n- ZXTune\n\nإخلاء المسؤولية:\nالوصول عبر الإنترنت إلى مكتبات Modland وHVSC وASMA مقدم كخدمة كما هي، ولا يوجد ضمان للتوفر و/أو الوظيفة. استخدم هذا التطبيق على مسؤوليتك الخاصة.";


// ================================
// MARK: - SUPPORT
// ================================

"Mail support" = "الدعم عبر البريد";
"Contact support by email" = "التواصل مع الدعم عبر البريد الإلكتروني";
"[Please describe your request below]" = "[يرجى وصف طلبك أدناه]";


// ================================
// MARK: - DONATION / TIPS
// ================================

"Thank You! ❤️" = "شكراً لك! ❤️";
"Send a tip to Modizer" = "إرسال إكرامية إلى Modizer";
"Support Modizer development" = "دعم تطوير Modizer";


// ================================
// MARK: - LAUNCH / INITIALIZATION
// ================================

"Cleaning DB & \nreseting settings" = "تنظيف قاعدة البيانات\nوإعادة تعيين الإعدادات";
"First launch or issue encountered last time Modizer was running. Apply default settings?" = "التشغيل الأول أو مشكلة واجهت في المرة الأخيرة التي كان Modizer يعمل فيها. تطبيق الإعدادات الافتراضية؟";


// ================================
// ================================
// MARK: - SIRI / APP INTENTS
// ================================

/* عناوين النوايا */
"Play" = "تشغيل";
"Pause" = "إيقاف مؤقت";
"Stop" = "إيقاف";
"Next Song" = "الأغنية التالية";
"Previous Song" = "الأغنية السابقة";
"Play Subsong" = "تشغيل أغنية فرعية";
"Seek" = "البحث";
"Set Infinite Loop" = "تعيين حلقة لانهائية";
"Set Loop Mode" = "تعيين وضع التكرار";
"Set Shuffle Mode" = "تعيين وضع العشوائي";
"Toggle Shuffle" = "تبديل العشوائي";
"Toggle Loop Mode" = "تبديل وضع التكرار";
"Set Fullscreen mode" = "تعيين وضع ملء الشاشة";
"Go the player view" = "الانتقال إلى عرض المشغل";
"Set FX" = "تعيين المؤثرات";
"Get Now Playing" = "الحصول على قيد التشغيل الآن";
"Get Playlists" = "الحصول على قوائم التشغيل";
"Play some music" = "تشغيل بعض الموسيقى";
"Play most played" = "تشغيل الأكثر تشغيلاً";
"Play favorites" = "تشغيل المفضلة";
"Play Playlist" = "تشغيل قائمة التشغيل";
"Play Playlist By Name" = "تشغيل قائمة التشغيل بالاسم";

/* أوصاف النوايا */
"Starts playing music in Modizer." = "يبدأ تشغيل الموسيقى في Modizer.";
"Pauses music playback in Modizer." = "يوقف تشغيل الموسيقى مؤقتاً في Modizer.";
"Stops music playback in Modizer." = "يوقف تشغيل الموسيقى في Modizer.";
"Skips to the next song in Modizer." = "ينتقل إلى الأغنية التالية في Modizer.";
"Skips to the previous song in Modizer." = "ينتقل إلى الأغنية السابقة في Modizer.";
"Plays a specific subsong in the current file." = "يشغل أغنية فرعية محددة في الملف الحالي.";
"Seeks to a specific position in the current song." = "يبحث عن موضع محدد في الأغنية الحالية.";
"Set the infinite loop mode in Modizer." = "يعين وضع الحلقة اللانهائية في Modizer.";
"Set the loop mode in Modizer." = "يعين وضع التكرار في Modizer.";
"Set the shuffle mode in Modizer." = "يعين وضع العشوائي في Modizer.";
"Toggles shuffle mode in Modizer." = "يبدل وضع العشوائي في Modizer.";
"Toggles loop mode in Modizer." = "يبدل وضع التكرار في Modizer.";
"Set Fullscreen mode on or off in Modizer." = "يشغل أو يوقف وضع ملء الشاشة في Modizer.";
"Go the player view in Modizer." = "ينتقل إلى عرض المشغل في Modizer.";
"Set FX mode in Modizer." = "يعين وضع المؤثرات في Modizer.";
"Gets information about the currently playing song." = "يحصل على معلومات حول الأغنية قيد التشغيل حالياً.";
"Gets the list of available playlists in Modizer." = "يحصل على قائمة قوائم التشغيل المتاحة في Modizer.";
"Random picks from available local titles in Modizer." = "اختيارات عشوائية من العناوين المحلية المتاحة في Modizer.";
"Most played titles from available local titles in Modizer." = "العناوين الأكثر تشغيلاً من العناوين المحلية المتاحة في Modizer.";
"Favorites titles from available local titles in Modizer." = "العناوين المفضلة من العناوين المحلية المتاحة في Modizer.";
"Plays a specific playlist in Modizer. Note: For best results with voice commands, use 'Play Playlist By Name' instead." = "يشغل قائمة تشغيل محددة في Modizer. ملاحظة: للحصول على أفضل النتائج مع الأوامر الصوتية، استخدم 'تشغيل قائمة التشغيل بالاسم' بدلاً من ذلك.";
"Plays a playlist by name in Modizer. Recommended for voice commands." = "يشغل قائمة تشغيل بالاسم في Modizer. موصى به للأوامر الصوتية.";

/* المعاملات */
"Subsong Index" = "فهرس الأغنية الفرعية";
"The index of the subsong to play" = "فهرس الأغنية الفرعية للتشغيل";
"Position (seconds)" = "الموضع (بالثواني)";
"The position to seek to in seconds" = "الموضع المراد البحث عنه بالثواني";
"Relative" = "نسبي";
"Whether to seek relative to current position" = "ما إذا كان البحث نسبياً للموضع الحالي";
"Infinite Loop Mode" = "وضع الحلقة اللانهائية";
"0: off, 1: infinite loop" = "0: إيقاف، 1: حلقة لانهائية";
"Repeat Mode" = "وضع التكرار";
"0: off, 1: loop current title, 2: loop playlist" = "0: إيقاف، 1: تكرار العنوان الحالي، 2: تكرار قائمة التشغيل";
"Shuffle Mode" = "وضع العشوائي";
"0: off, 1: choose only one title if file has subsongs or is an archive, 2: play all titles of a given file" = "0: إيقاف، 1: اختر عنواناً واحداً فقط إذا كان الملف يحتوي على أغانٍ فرعية أو أرشيف، 2: تشغيل جميع عناوين ملف معين";
"Fullscreen mode" = "وضع ملء الشاشة";
"Activate (1) or disactivate (0) Fullscreen mode" = "تنشيط (1) أو إلغاء تنشيط (0) وضع ملء الشاشة";
"FX" = "المؤثرات";
"The FX to set" = "المؤثرات المراد تعيينها";
"FX Mode" = "وضع المؤثرات";
"The mode to activate for the selected FX (0:off)" = "الوضع المراد تنشيطه للمؤثرات المحددة (0:إيقاف)";
"Playlist" = "قائمة التشغيل";
"The playlist to play" = "قائمة التشغيل المراد تشغيلها";
"Start Index" = "فهرس البداية";
"The index of the song to start playing from (0-based)" = "فهرس الأغنية لبدء التشغيل منه (مبني على 0)";
"Playlist Name" = "اسم قائمة التشغيل";
"The name of the playlist to play" = "اسم قائمة التشغيل المراد تشغيلها";
"Which playlist would you like to play?" = "أي قائمة تشغيل تريد تشغيلها؟";

/* رسائل الحوار */
"play_playlist_dialog" = "تشغيل قائمة التشغيل %@";
"Playlist not found. Use 'Get Playlists' to see available playlists." = "لم يتم العثور على قائمة التشغيل. استخدم 'الحصول على قوائم التشغيل' لرؤية قوائم التشغيل المتاحة.";
"No playlists found" = "لم يتم العثور على قوائم تشغيل";

/* أسماء المؤثرات */
"ProjectM" = "ProjectM";
"Oscillo" = "مذبذب";
"Piano roll" = "لفة البيانو";
"3D Piano" = "بيانو ثلاثي الأبعاد";
"Notes bars" = "أشرطة النوتات";
"Tracker" = "متتبع";
"2D Spectrum" = "طيف ثنائي الأبعاد";
"3D Spectrum" = "طيف ثلاثي الأبعاد";
"3D Landscape" = "منظر طبيعي ثلاثي الأبعاد";

// ================================

"Get Now Playing" = "الحصول على المشغل الآن";
"Which playlist would you like to play?" = "أي قائمة تشغيل تريد تشغيلها؟";


// ================================


// ================================
// MARK: - VOICE COMMANDS UI
// ================================

"Voice Commands" = "الأوامر الصوتية";
"Siri voice commands for Modizer" = "أوامر Siri الصوتية لـ Modizer";
"Voice Commands: Playback" = "التشغيل";
"Voice Commands: Navigation" = "التنقل";
"Voice Commands: Playlists" = "قوائم التشغيل";
"Voice Commands: Modes" = "الأوضاع";
// MARK: - TABS
// ================================

"Search" = "بحث";
"More" = "المزيد";
"Suspend" = "تعليق";
"Clear all" = "مسح الكل";
"Online" = "متصل";


// ================================
// MARK: - MORE TAB
// ================================

"About" = "حول";
"Some general informations" = "بعض المعلومات العامة";
"Settings" = "الإعدادات";
"Global, Visu, FTP & Plugins" = "عامة، مرئيات، FTP والإضافات";
"Maintenance" = "الصيانة";
"Clean DB, Reset ratings, ..." = "تنظيف قاعدة البيانات، إعادة تعيين التصنيفات، ...";


// ================================
// MARK: - ONLINE TAB / COLLECTIONS
// ================================

/* Section Headers */
"Collections" = "المجموعات";
"Browse Internet" = "تصفح الإنترنت";
"Games Music" = "موسيقى الألعاب";
"Mods & chiptunes" = "موديولات وموسيقى الشرائح";
"Other" = "أخرى";

/* Collections */
"MODLAND collection" = "مجموعة MODLAND";
"HVSC collection" = "مجموعة HVSC";
"ASMA collection" = "مجموعة ASMA";
"JOSHW collection" = "مجموعة JOSHW";
"VGMRips collection" = "مجموعة VGMRips";
"SNESmusic collection" = "مجموعة SNESmusic";
"SMS Power! collection" = "مجموعة SMS Power!";
"ZXArt collection" = "مجموعة ZXArt";

/* Collection Descriptions */
"%d entries" = "%d إدخال";
"Thousands of entries" = "آلاف الإدخالات";
"2K+ packs / 40K+ songs" = "أكثر من 2000 حزمة / أكثر من 40000 أغنية";
"1500+ sets / Super Nintendo/Famicom" = "أكثر من 1500 مجموعة / سوبر نينتندو/فاميكوم";
"Master System & Game gear sets" = "مجموعات Master System وGame Gear";
"ZX Spectrum" = "ZX Spectrum";

/* Internet */
"Modizer World Charts" = "قوائم Modizer العالمية";
"Web browser" = "متصفح الويب";
"No internet connectivity or website down." = "لا يوجد اتصال بالإنترنت أو الموقع معطل.";

// ================================
// MARK: - SETTINGS - FAMILIES & UI
// ================================

/* Settings Families */
"Global" = "عامة";
"Default Players" = "المشغلات الافتراضية";
"Visualizers" = "المرئيات";
"PR & NS colors settings" = "إعدادات ألوان PR وNS";
"Plugins" = "الإضافات";

/* Player Selection */
"MOD player" = "مشغل MOD";
"SAP player" = "مشغل SAP";
"SID player" = "مشغل SID";
"VGM player" = "مشغل VGM";
"YM player" = "مشغل YM";
"NSF player" = "مشغل NSF";
"PT3 player" = "مشغل PT3";
"GBS player" = "مشغل GBS";
"KSS player" = "مشغل KSS";
"2SF player" = "مشغل 2SF";
"MIDI player" = "مشغل MIDI";

/* Global Player Settings - Additional Descriptions */
"Only for plugins supporting this feature (GME, NSFPLAY, LIBVGM)" = "فقط للإضافات التي تدعم هذه الميزة (GME، NSFPLAY، LIBVGM)";
"0=auto, delay rounded to a multiple of audio buffer size" = "0=تلقائي، التأخير مقرب لمضاعف حجم المخزن المؤقت للصوت";
"Limited: not for subsong" = "محدود: ليس للأغنية الفرعية";
"Default value is 3s" = "القيمة الافتراضية هي 3 ثوانٍ";
"Default action when selecting an archive or a multisong file" = "الإجراء الافتراضي عند اختيار أرشيف أو ملف متعدد الأغاني";
"Play only selected entry or full archive/multisong file" = "تشغيل الإدخال المحدد فقط أو الأرشيف/الملف متعدد الأغاني بالكامل";
"Show Welcome screen" = "إظهار شاشة الترحيب";
"Adplug priority for module" = "أولوية Adplug للوحدة";

/* FTP Settings */
"Server status" = "حالة الخادم";
"FTP Server" = "خادم FTP";
"Authorize anonymous" = "السماح بالمجهول";
"User" = "المستخدم";
"Password" = "كلمة المرور";
"Port" = "المنفذ";

/* Online Settings */
"MODLAND URL" = "رابط MODLAND";
"HVSC URL" = "رابط HVSC";
"ASMA URL" = "رابط ASMA";
"MODLAND Server" = "خادم MODLAND";
"MODLAND cust.URL" = "رابط MODLAND مخصص";
"HVSC Server" = "خادم HVSC";
"HVSC cust.URL" = "رابط HVSC مخصص";
"ASMA Server" = "خادم ASMA";
"ASMA cust.URL" = "رابط ASMA مخصص";


// ================================
// MARK: - SETTINGS - ADDITIONAL PLUGIN SETTINGS
// ================================

/* Visualization - MOD Pattern */
"Patterns BG Alpha" = "شفافية خلفية الأنماط";
"Opacity of mod patterns view" = "شفافية عرض أنماط MOD";
"MOD Color Theme" = "سمة ألوان MOD";
"MOD Current Line" = "السطر الحالي لـ MOD";
"MOD Volume bars" = "أشرطة مستوى صوت MOD";
"MOD Pattern Font" = "خط نمط MOD";
"MOD Pattern Font Size" = "حجم خط نمط MOD";

/* Visualization - Piano Roll / MIDI */
"Piano Roll FX" = "مؤثرات لفافة البيانو";
"PR/Spark FX" = "مؤثرات PR/الشرارة";
"Display voices label" = "عرض تسمية الأصوات";
"Notes scroller FX" = "مؤثرات تمرير النوتات";
"NS/bars mode" = "وضع NS/الأشرطة";
"NS/bars style" = "نمط NS/الأشرطة";
"Vibrato display" = "عرض الاهتزاز";
"Piano FX" = "مؤثرات البيانو";
"Piano bars mode" = "وضع أشرطة البيانو";

/* Visualization - Spectrum */
"3D Sp.Bloom" = "توهج الطيف ثلاثي الأبعاد";
"3D Land. Bloom" = "توهج المنظر ثلاثي الأبعاد";
"0: off" = "0: إيقاف";

/* ProjectM Settings */
"ProjectM FX" = "مؤثرات ProjectM";
"Rendering quality: Max is pixel resolution, 1/2 is half, ..." = "جودة العرض: الأقصى هو دقة البكسل، 1/2 هو النصف، ...";
"Custom presets/textures should be copied in .projectm folder" = "يجب نسخ الإعدادات المسبقة/الأنسجة المخصصة في مجلد .projectm";
"Display preset name" = "عرض اسم الإعداد المسبق";
"Lim: display and disappear quickly" = "محدود: عرض واختفاء سريع";
"Auto switch presets" = "التبديل التلقائي للإعدادات المسبقة";
"Allow loading of milk file with script issues" = "السماح بتحميل ملف milk مع مشاكل السكريبت";
"Default is 15s" = "الافتراضي 15 ثانية";
"Default is 2.7s" = "الافتراضي 2.7 ثانية";
"Default value is 32" = "القيمة الافتراضية 32";
"Default value is 24" = "القيمة الافتراضية 24";
"Default value is 20" = "القيمة الافتراضية 20";
"Hardcut" = "قطع حاد";
"Hardcut triggers presets switch synchronized with beats." = "القطع الحاد يشغل تبديل الإعدادات المسبقة متزامناً مع النبضات.";
"Hardcut min time" = "الحد الأدنى لوقت القطع الحاد";
"Preserve aspect ratio for compatible shaders." = "الحفاظ على نسبة العرض للتظليلات المتوافقة.";
"Default value is 1" = "القيمة الافتراضية 1";
"Hardcut sensitivity" = "حساسية القطع الحاد";

/* Oscilloscope Settings */
"Oscillo FX" = "مؤثرات الراسم";
"Oscillo show labels" = "إظهار تسميات الراسم";
"Oscillo labels font size" = "حجم خط تسميات الراسم";
"Oscillo show grid" = "إظهار شبكة الراسم";
"Oscillo line width" = "عرض خط الراسم";
"Reset all custom colors" = "إعادة تعيين جميع الألوان المخصصة";
"Multi color | System 1" = "ألوان متعددة | النظام 1";
"Multi color | System 2" = "ألوان متعددة | النظام 2";
"Multi color | System 3" = "ألوان متعددة | النظام 3";
"Multi color | System 4" = "ألوان متعددة | النظام 4";
"Multi color | System 5" = "ألوان متعددة | النظام 5";
"Multi color | System 6" = "ألوان متعددة | النظام 6";
"Multi color | System 7" = "ألوان متعددة | النظام 7";
"Multi color | System 8" = "ألوان متعددة | النظام 8";

/* Piano/MIDI Colors */
"Custom color 01" = "لون مخصص 01";
"Custom color 02" = "لون مخصص 02";
"Custom color 03" = "لون مخصص 03";
"Custom color 04" = "لون مخصص 04";
"Custom color 05" = "لون مخصص 05";
"Custom color 06" = "لون مخصص 06";
"Custom color 07" = "لون مخصص 07";
"Custom color 08" = "لون مخصص 08";
"Custom color 09" = "لون مخصص 09";
"Custom color 10" = "لون مخصص 10";
"Custom color 11" = "لون مخصص 11";
"Custom color 12" = "لون مخصص 12";
"Custom color 13" = "لون مخصص 13";
"Custom color 14" = "لون مخصص 14";
"Custom color 15" = "لون مخصص 15";
"Custom color 16" = "لون مخصص 16";
"Custom color 17" = "لون مخصص 17";
"Custom color 18" = "لون مخصص 18";
"Custom color 19" = "لون مخصص 19";
"Custom color 20" = "لون مخصص 20";
"Custom color 21" = "لون مخصص 21";
"Custom color 22" = "لون مخصص 22";
"Custom color 23" = "لون مخصص 23";
"Custom color 24" = "لون مخصص 24";
"Custom color 25" = "لون مخصص 25";
"Custom color 26" = "لون مخصص 26";
"Custom color 27" = "لون مخصص 27";
"Custom color 28" = "لون مخصص 28";
"Custom color 29" = "لون مخصص 29";
"Custom color 30" = "لون مخصص 30";
"Custom color 31" = "لون مخصص 31";
"Custom color 32" = "لون مخصص 32";

/* Plugin Settings - Libopenmpt */
"Libopenmpt" = "Libopenmpt";

/* Plugin Settings - GME */
"GME" = "GME";
"Will skip song if nothing is played for specified duration (0=off)" = "سيتم تخطي الأغنية إذا لم يتم تشغيل شيء للمدة المحددة (0=إيقاف)";

/* Plugin Settings - GSF */
"GSF" = "GSF";

/* Plugin Settings - NSFPLAY */
"NSFPLAY" = "NSFPLAY";
"Default length" = "المدة الافتراضية";
"Oversampling. Min=0, default: 10" = "أخذ عينات فائق. الحد الأدنى=0، الافتراضي: 10";
"Min=off, default: 112" = "الحد الأدنى=إيقاف، الافتراضي: 112";
"Max=off, default: 164" = "الحد الأقصى=إيقاف، الافتراضي: 164";
"1/2/3=NTSC/PAL/DENDY\n4/5/6=force NTSC/PAL/DENDY" = "1/2/3=NTSC/PAL/DENDY\n4/5/6=فرض NTSC/PAL/DENDY";
"Forces IRQ capability for all NSFs, not just NSF2" = "فرض قدرة IRQ لجميع NSF، ليس فقط NSF2";
"APU unmute on reset" = "إلغاء كتم APU عند إعادة التعيين";
"APU phase reset" = "إعادة تعيين مرحلة APU";
"APU non linear mixing" = "مزج APU غير خطي";
"APU swap duty 1/2" = "تبديل دورة APU 1/2";
"APU Initialize sweep unmute" = "تهيئة إلغاء كتم المسح APU";
"DMC enable $4011 writes" = "تفعيل كتابات DMC $4011";
"DMC enable periodic noise" = "تفعيل الضوضاء الدورية DMC";
"DMC unmute on reset" = "إلغاء كتم DMC عند إعادة التعيين";
"DMC anti clicking" = "مضاد النقر DMC";
"DMC non linear mixer" = "مازج DMC غير خطي";
"DMC randomize noise on reset" = "عشوائية ضوضاء DMC عند إعادة التعيين";
"DMC mute triangle on pitch 0" = "كتم المثلث DMC عند درجة 0";
"prevents high frequency aliasing" = "منع التعرجات العالية التردد";
"DMC rand. triangle" = "مثلث عشوائي DMC";
"randomize triangle on reset" = "عشوائية المثلث عند إعادة التعيين";
"DMC reverse bits" = "عكس بتات DMC";
"reverse bits of DPCM sample bytes" = "عكس بتات بايتات عينة DPCM";
"MMC5 non linear mixing" = "مزج MMC5 غير خطي";
"MMC5 Phase reset" = "إعادة تعيين مرحلة MMC5";
"Reset phase counter after write $5003 and $5007" = "إعادة تعيين عداد المرحلة بعد كتابة $5003 و$5007";
"FDS LP filter in Hz" = "مرشح FDS LP بالهرتز";
"Cutoff frequency (0Hz=off, 2000Hz=default)" = "تردد القطع (0Hz=إيقاف، 2000Hz=افتراضي)";
"FDS reset \"phase\"" = "إعادة تعيين \"المرحلة\" FDS";
"$4085 \"resets\" modular phase" = "$4085 \"إعادة تعيين\" المرحلة النمطية";
"FDS write protect" = "الحماية ضد الكتابة FDS";
"write protect $8000-DFFF" = "الحماية ضد الكتابة $8000-DFFF";
"VRC7 Replace with OPLL" = "استبدال VRC7 بـ OPLL";
"N163 Serial Multiplex mixing" = "مزج التعدد التسلسلي N163";
"N163 Write Protect Phase" = "مرحلة الحماية ضد الكتابة N163";
"N163 Limit Wavelength" = "حد الطول الموجي N163";

/* Plugin Settings - ADPLUG */
"ADPLUG" = "ADPLUG";

/* Plugin Settings - HC (Highly Complete) */
"HC" = "HC";
"Only for HC plugin" = "فقط لإضافة HC";

/* Plugin Settings - SID */
"SID" = "SID";
"Digiboost" = "تعزيز رقمي";

/* Plugin Settings - TIMIDITY */
"TIMIDITY" = "TIMIDITY";

/* Plugin Settings - UADE */
"UADE" = "UADE";
"Panning value" = "قيمة التوزيع الصوتي";
"Gain value" = "قيمة الكسب";

/* Plugin Settings - VGMPlay */
"VGMPLAY" = "VGMPLAY";

/* Plugin Settings - VGMStream */
"VGMSTREAM" = "VGMSTREAM";

/* Plugin Settings - XMP */
"XMP" = "XMP";

/* Plugin Settings - SEXYPSF */
"SEXYPSF" = "SEXYPSF";

/* Plugin Settings - GBSPlay */
"GBS" = "GBS";

/* Plugin Settings - STSOUND */
"STSOUND" = "STSOUND";

/* Plugin Settings - SC68 */
"SC68" = "SC68";

/* Additional Settings */
"Disable" = "تعطيل";
"Enter playlist name" = "أدخل اسم قائمة التشغيل";
"Ask" = "اسأل";
"Play All" = "تشغيل الكل";
"Single" = "مفرد";
"Archive" = "أرشيف";
"On" = "تشغيل";
"Off" = "إيقاف";
"Lim" = "محدود";

// ================================
// MARK: - PLAYLISTS - ADDITIONAL ENTRIES
// ================================

/* Playlist Menu Entries */
"Add a playlist" = "إضافة قائمة تشغيل";
"Create a new playlist" = "إنشاء قائمة تشغيل جديدة";
"Now playing" = "قيد التشغيل الآن";
"1 entry" = "إدخال واحد";
"No entry" = "لا توجد إدخالات";
"Random picks" = "اختيارات عشوائية";
"Generate a randomized playlist" = "إنشاء قائمة تشغيل عشوائية";
"Most played" = "الأكثر تشغيلاً";
"Favorites" = "المفضلة";

/* Playlist Actions */
"Add/Remove files..." = "إضافة/إزالة ملفات...";
"More actions..." = "إجراءات إضافية...";
"Save as a new playlist" = "حفظ كقائمة تشغيل جديدة";

// ================================
// MARK: - WELCOME PAGES
// ================================

"Welcome to Modizer!\n" = "مرحباً بك في Modizer!\n";
"Level up your library" = "ارتق بمكتبتك";
"Sound meets visuals." = "الصوت يلتقي بالمرئيات.";
"Made with passion,\noffered for free." = "صُنع بشغف،\nيُقدم مجاناً.";

/* Welcome Page Messages */
"Your gateway to retro and tracker music.\nPower up your device with legendary game tunes, iconic tracker modules, and timeless chiptune classics." = "بوابتك لموسيقى الريترو والتراكر.\nعزز جهازك بألحان الألعاب الأسطورية ووحدات التراكر الأيقونية وكلاسيكيات موسيقى الشرائح الخالدة.";

"Browse and stream from online catalogs, to complete your own collections.\nBuild, edit, and listen to playlists effortlessly." = "استعرض وابث من الكتالوجات عبر الإنترنت، لإكمال مجموعاتك الخاصة.\nأنشئ، وحرر، واستمع لقوائم التشغيل بسهولة.";

"Unlock classic oscilloscope looks, spectrum bars, piano rolls, trackers view and ProjectM/Milkdrop FX. Let Modizer paint each track with motion and color." = "افتح مظهر الراسم الكلاسيكي، وأشرطة الطيف، ولفائف البيانو، وعرض التراكر، ومؤثرات ProjectM/Milkdrop. دع Modizer يرسم كل مقطوعة بالحركة واللون.";

"If you enjoy the app, tips are a great way to support its ongoing development.\nThank you for helping keep Modizer alive and evolving." = "إذا كنت تستمتع بالتطبيق، فإن الإكراميات طريقة رائعة لدعم تطويره المستمر.\nشكراً لمساعدتك في إبقاء Modizer حياً ومتطوراً.";

"Skip" = "تخطي";

// ================================
// MARK: - TIPS / DONATIONS
// ================================

/* Tips Screen */
"Support with a Tip" = "الدعم بإكرامية";
"Enjoy Modizer ?" = "هل تستمتع بـ Modizer؟";
"Your support helps keep Modizer running and ad-free!" = "دعمك يساعد في إبقاء Modizer يعمل وخالياً من الإعلانات!";
"Already tipped so far" = "تم تقديم إكرامية حتى الآن";
"Thank you for your support! ❤️" = "شكراً لدعمك! ❤️";

/* Tip Tiers */
"Coffee" = "قهوة";
"Coffee & Croissant" = "قهوة وكرواسون";
"Dinner" = "عشاء";
"Loading..." = "جاري التحميل...";

/* Tip Actions */
"Confirm Tip" = "تأكيد الإكرامية";
"Send Tip" = "إرسال إكرامية";
"Send a %@ tip for %@?" = "إرسال إكرامية %@ مقابل %@؟";
"Tip" = "إكرامية";

/* Tip Errors */
"Unable to load products. Please check your internet connection." = "تعذر تحميل المنتجات. يرجى التحقق من اتصالك بالإنترنت.";

/* Thank You Alert */
"Thank You! ❤️" = "شكراً لك! ❤️";
"Your support means everything! Thank you for helping keep Modizer running." = "دعمك يعني كل شيء! شكراً لمساعدتك في إبقاء Modizer يعمل.";

// ================================
// MARK: - MAINTENANCE SCREEN
// ================================

/* Maintenance Actions */
"Clean Database" = "تنظيف قاعدة البيانات";
"Clear 'Now Playing' queue" = "مسح قائمة 'قيد التشغيل الآن'";
"Recreate Samples folder" = "إعادة إنشاء مجلد العينات";
"Reset settings to default" = "إعادة تعيين الإعدادات للافتراضية";
"Remove current cover" = "إزالة الغلاف الحالي";
"Reset Ratings" = "إعادة تعيين التصنيفات";
"Reset Played Counters" = "إعادة تعيين عدادات التشغيل";
"Reset Database" = "إعادة تعيين قاعدة البيانات";
"Clear images cache" = "مسح ذاكرة الصور المؤقتة";

/* Maintenance Messages */
"Settings reseted" = "تم إعادة تعيين الإعدادات";
"Ratings reseted" = "تم إعادة تعيين التصنيفات";
"Played Counters reseted" = "تم إعادة تعيين عدادات التشغيل";
"Samples folder created" = "تم إنشاء مجلد العينات";
"Cache cleaned" = "تم تنظيف الذاكرة المؤقتة";
"Database reseted" = "تم إعادة تعيين قاعدة البيانات";
"No cover to remove" = "لا يوجد غلاف لإزالته";
"Cover removed" = "تم إزالة الغلاف";
"Database cleaned" = "تم تنظيف قاعدة البيانات";

/* Maintenance Confirmations */
"Are you sure you want to clean the DB, it might take a while ?" = "هل أنت متأكد من تنظيف قاعدة البيانات، قد يستغرق بعض الوقت؟";
"Clean" = "تنظيف";
"Cleaning DB" = "جاري تنظيف قاعدة البيانات";
"Cancelling..." = "جاري الإلغاء...";

// ================================
// MARK: - PLAYERMENU
// ================================

"Close FX\nwindow" = "إغلاق نافذة\nالمؤثرات";
"All FX off" = "جميع المؤثرات متوقفة";
"FX\nalpha" = "شفافية\nالمؤثرات";
"Show name\ntemp." = "إظهار الاسم\nمؤقتاً";
"Show name" = "إظهار الاسم";
"Bundled\npresets" = "إعدادات\nمدمجة";
"Custom\npresets" = "إعدادات\nمخصصة";
"Blend\npresets" = "مزج\nالإعدادات";
"Clear\nall" = "مسح\nالكل";
"Select\nall" = "تحديد\nالكل";
"Favorites" = "المفضلة";
"Expand" = "توسيع";
"Select\nlisted" = "تحديد\nالمدرجة";
"Remove\nlisted" = "إزالة\nالمدرجة";
"Selected" = "محدد";
"Collapse" = "طي";
"Labels" = "التسميات";
"Grid" = "الشبكة";
"Voices\nlabels" = "تسميات\nالأصوات";
"Octaves\nlabels" = "تسميات\nالأوكتافات";
"Volume\nbars" = "أشرطة\nالصوت";
"Fixed bar" = "شريط ثابت";
"BG\nopacity" = "شفافية\nالخلفية";
"Bloom:\n%s" = "توهج:\n%s";
"Thickness:\n%s" = "السُمك:\n%s";
"Font size\n%s" = "حجم الخط\n%s";
"Font:\n%s" = "الخط:\n%s";
"Info HUD:\n%s" = "معلومات HUD:\n%s";
"Select active %s presets" = "تحديد إعدادات %s النشطة";
"bundled" = "مدمجة";
"custom" = "مخصصة";
"Select\ncustom\npresets" = "تحديد\nإعدادات\nمخصصة";
"Select\nbundled\npresets" = "تحديد\nإعدادات\nمدمجة";
"Themes:\n%s" = "السمات:\n%s";



// MARK: - Voice Commands phrases
"Play some music in Modizer" = "تشغيل موسيقى في Modizer";
"Start random playlist in Modizer" = "ابدأ قائمة عشوائية في Modizer";
"Play favorites in Modizer" = "تشغيل المفضلة في Modizer";
"Start favorites playlist in Modizer" = "ابدأ قائمة المفضلة في Modizer";
"Play most played in Modizer" = "تشغيل الأكثر تشغيلاً في Modizer";
"Start most played playlist in Modizer" = "ابدأ قائمة الأكثر تشغيلاً في Modizer";
"Play a playlist in Modizer" = "تشغيل قائمة تشغيل في Modizer";
"Start a playlist in Modizer" = "ابدأ قائمة تشغيل في Modizer";
"Toggle shuffle mode in Modizer" = "تبديل وضع العشوائية في Modizer";
"Change shuffle mode in Modizer" = "تغيير وضع الخلط في Modizer";
"Change loop mode in Modizer" = "تغيير وضع التكرار في Modizer";
"Toggle repeat in Modizer" = "تبديل التكرار في Modizer";
"What's playing in Modizer" = "ما الذي يتم تشغيله في Modizer";
"Current song in Modizer" = "الأغنية الحالية في Modizer";

/* Error messages */
"playlist_not_found_error" = "قائمة التشغيل غير موجودة. استخدم 'الحصول على قوائم التشغيل' لرؤية القوائم المتاحة.";
"playlist_empty_error" = "قائمة التشغيل هذه لا تحتوي على إدخالات. يرجى إضافة الموسيقى أولاً.";
